In [1]:
import sqlite3

conn = sqlite3.connect('test.db')

In [5]:
import sqlite3

conn = sqlite3.connect('test.db')

conn.execute('''CREATE TABLE Students (
  Id INT PRIMARY KEY NOT NULL, 
  Name VARCHAR(30) NOT NULL, 
  DoB DATE NOT NULL, 
  Degree VARCHAR(20)); ''')
  
conn.close()

In [6]:
import sqlite3

conn = sqlite3.connect('test.db')

conn.execute( "INSERT INTO Students VALUES (1, 'Ashok', '2000-10-27', 'M.Tech')" )

conn.execute( "INSERT INTO Students (Name, Id, Degree, DoB) VALUES ('Binu', 2, 'M.Tech', '2000-07-15')" )

conn.execute( "INSERT INTO Students (Id, Name, Degree, DoB) \
        VALUES (3, 'Caesar', 'B.Tech', '2002-02-09')" )

conn.execute( "INSERT INTO Students VALUES \
        (4, 'Daniel', '2002-02-09', 'M.C.A')" )
        
conn.commit()

conn.close()

In [7]:
import sqlite3

conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT Id, Name, DoB, Degree FROM Students")
for row in cursor:
   print( "Id = ", row[0], " | Name = ", row[1], " | DoB = ", row[2], " | Degree = ", row[3] )
   # print( row )  # Comment out above and uncomment this, check the output
   
conn.close()

Id =  1  | Name =  Ashok  | DoB =  2000-10-27  | Degree =  M.Tech
Id =  2  | Name =  Binu  | DoB =  2000-07-15  | Degree =  M.Tech
Id =  3  | Name =  Caesar  | DoB =  2002-02-09  | Degree =  B.Tech
Id =  4  | Name =  Daniel  | DoB =  2002-02-09  | Degree =  M.C.A

In [8]:
import sqlite3

conn = sqlite3.connect('test.db')

conn.execute("UPDATE Students SET Degree = 'B.E.' WHERE Degree = 'B.Tech'")
conn.commit()
print("Total number of rows updated :", conn.total_changes)

cursor = conn.execute("SELECT Id, Name, DoB, Degree FROM Students WHERE Degree = 'B.E.'")
for row in cursor:
   print(row)

conn.close()

Total number of rows updated : 1
(3, 'Caesar', '2002-02-09', 'B.E.')

In [9]:
import sqlite3

conn = sqlite3.connect('test.db')

conn.execute("DELETE FROM Students WHERE Id = 4")
conn.commit()
print("Total number of rows deleted :", conn.total_changes)

cursor = conn.execute("SELECT * FROM Students")
for row in cursor:
   print(row[0], row[1])

conn.close()

Total number of rows deleted : 1
1 Ashok
2 Binu
3 Caesar